Revit 2024 API
AnalysisDisplayColorSettings.ColorSettingsType Property
 Stores type of color settings
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalysisDisplayStyleColorSettingsType ColorSettingsType { get; set; }
Visual Basic
Public Property ColorSettingsType As AnalysisDisplayStyleColorSettingsType
	Get
	Set
Visual C++
public:
property AnalysisDisplayStyleColorSettingsType ColorSettingsType {
	AnalysisDisplayStyleColorSettingsType get ();
	void set (AnalysisDisplayStyleColorSettingsType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace